{
  "Sidebar": {
    "role": "Software Engineer",
    "professional": {
      "title": "Professional career",
      "links": [
        {
          "title": "Resumeé",
          "url": "/"
        },
        {
          "title": "Services",
          "url": "/career/services"
        },
        {
          "title": "Projects",
          "url": "/career/projects"
        }
      ]
    },
    "contact": {
      "title": "Contact info"
    },
    "complementary": {
      "sidebar": {
        "title": "Toggle sidebar"
      },
      "pdf": {
        "title": "Download CV",
        "dialog": {
          "title": "Download Curriculum Vitae",
          "description": "Download my resume as PDF 🌟",
          "button": "Generate",
          "loading": "Generating..."
        }
      },
      "theme": {
        "title": "Change color theme",
        "light": "Light",
        "dark": "Dark",
        "system": "System"
      },
      "activity": {
        "title": "Open latest activity",
        "dialog": {
          "title": "Latest Activity Feed Updates",
          "description": "Here you will find the most recent and quick updates from my personal projects or news.",
          "button": "Check my Github profile",
          "empty": "There is not recent activity, try later."
        }
      }
    },
    "footer": {
      "mobile": {
        "title": "Theme options"
      }
    }
  },
  "General": {
    "metadata": {
      "title": "About me | José Duque",
      "description": "Colombian web developer. Explore my portfolio, expertise, and comprehensive services to elevate your digital presence.",
      "keywords": [
        "Web developer",
        "Backend",
        "Frontend",
        "Full-Stack",
        "Node JS",
        "React",
        "Vue",
        "Javascript",
        "TypeScript"
      ]
    },
    "role": "Software Engineer",
    "resume": {
      "greetings": "Hi!, I'm ",
      "excerpt1": "Colombian Software Engineer with more than {years} years of experience in web application development.",
      "excerpt2": "I am focused on guaranteeing quality solutions based on good practices with technologies on <b>monolithic architectures</b> as well as <b>microservices architectures</b>.",
      "description": {
        "title": "What have I done?",
        "content": "During my working life, I have had the opportunity to have a broad view of the client specific needs to solve any technological challenge that arises; I have played roles as consultant, tech-lead and tech-coordinator in development teams for <b>public and private sector</b> companies such as the Alcaldía de Itagüí, Alcaldía de Bogotá, Ministerio de Educación Nacional and EAFIT University. I have also participated in custom development projects and websites development with full-time <b>Marketing agencies</b> and alternatively as a part-time <b>Freelancer</b>.<br></br><br></br><b>With software factories</b> I have had the opportunity to work for Educational Startups with great regional reach, as well as for the Banking sector, Insurances and Health businesses, which have allowed us to expand knowledge and comply with the rigidity of the policies of said market.<br></br><br></br>In accordance with the search for a more specialized orientation to the most popular technologies, I have participated in national intensive learning sessions of Node JS and carried out individual studies on Frontend technologies such as React JS, Vue JS, as well as other basic approaches in Angular.<br></br><br></br>On the backend side, my studies in microservices-based architectures using Amazon Web Services and Azure DevOps have profiled me as a competent full-stack developer for the needs of the current market."
      }
    },
    "education": {
      "title": "Academic studies & certifications",
      "content": [
        {
          "start_date": "November 2021",
          "end_date": "",
          "enterprise": "",
          "isRecent": true,
          "project": "Certification",
          "role": "Boot-camp Node JS - Ruta N Corporation - Ceiba Software S.A.S - Globant"
        },
        {
          "start_date": "2010",
          "end_date": "2016",
          "enterprise": "",
          "isRecent": true,
          "project": "Professional degree",
          "role": "Software Engineering - Politécnico Colombiano Jaime Isaza Cadavid"
        },
        {
          "start_date": "2009",
          "end_date": "",
          "enterprise": "",
          "isRecent": true,
          "project": "Bachelor's degree",
          "role": "Colegio Paula Montal"
        }
      ]
    },
    "services": {
      "title": "Services",
      "title2": "Technology stack",
      "subtitle": "General services",
      "download_button": "Download resume",
      "experience": {
        "title": "Experience"
      },
      "languages": {
        "title": "Languages"
      },
      "tech_languages": {
        "title": "Tech languages"
      },
      "framelibs": {
        "title": "Libraries & Frameworks"
      },
      "knowledges": {
        "title": "Tools & Soft-skills"
      },
      "certifications": {
        "title": "Certifications"
      }
    },
    "languages": {
      "title": "Languages",
      "content": [
        {
          "title": "Spanish",
          "subtitle": "Native - C2"
        },
        {
          "title": "English",
          "subtitle": "Proficient - B2"
        }
      ]
    },
    "404": {
      "title": "Not found",
      "subtitle": "Could not find requested resource",
      "button": "Take me back"
    }
  },
  "Experience": {
    "metadata": {
      "title": "Projects | José Duque",
      "description": "Latest projects where I had been contributed"
    },
    "title": "Latest projects",
    "subtitle": "Responsabilities",
    "button": "External URL",
    "footer": "Skills",
    "no-results": "There are no projects that match the selected filters, try again",
    "filters": {
      "title": "Skills",
      "placeholder": "Search by {filter}",
      "input-placeholder": "Search filters",
      "max-selection": "+5 filters",
      "max-selection-mobile": "+1 filters",
      "no-results": "No results found",
      "reset": "Reset filters"
    },
    "content": [
      {
        "start_date": "2023",
        "end_date": "Present",
        "enterprise": "SURA Insurance - Ceiba Software S.A.S",
        "isRecent": true,
        "project": "SURA Insurance - Integrations Team Bus",
        "role": "Backend developer",
        "resume": [
          "Design and creation of serverless services for the Azure Cloud",
          "Implemented event-oriented architectures (RabbitMQ / ServiceBus) and HTTP/REST feature services aimed at solving all the required integrations between Salesforce Industries and SURA Colombia in the sales and shipping process vehicle insurance business."
        ],
        "additional_info": [
          "Azure Functions",
          "Azure Service Bus",
          "CosmoDB",
          "Terraform",
          "Microservices",
          "Node.js",
          "J Meter",
          "Unit Tests",
          "Integration Tests",
          "SonarQube",
          "Git",
          "JWT",
          "Scrum"
        ],
        "screenshot": "/static/img/showcase/sura_motos.webp",
        "url": "https://ecomm.sura.co/seguros/s/movilidad/motos/cotizador"
      },
      {
        "start_date": "11/07/2022",
        "end_date": "28/04/2023",
        "enterprise": "Aval Digital Labs - Aval AV Villas Group - Ceiba Software S.A.S",
        "isRecent": false,
        "project": "Aval Digital Labs - AV Villas Bank / Credit Card Infrastructure Migration team",
        "role": "Senior backend developer",
        "resume": [
          "Migration of legacy infrastructure from Amazon Web Services to Infrastructure as Code using Serverless Framework and Terraform guaranteeing enterprise standards and full supervision of the configuration of the application architecture components.",
          "Refactoring and optimization of the legacy code given to lambdas (Node-JS/Java) and monoliths (Java Springboot) involved in the application",
          "Improved up to a percentage greater than or equal to 85% of the Quality Gates standards against good practices required by the company",
          "Improved in a high percentage the execution performance of lambdas and code associated with step functions used in the application.",
          "Generation of new components with business logic added to support the work cell in parallel to production activities. migration, allowing flexibility between migration loads.",
          "Generation of security policies and vulnerability corrections in accordance with the OWASP standard",
          "the results of which adequately responded to the high internal demands of the organization Aval Digital Labs as well as Banco AV Villas."
        ],
        "additional_info": [
          "DynamoDB",
          "Node.js",
          "Spring Framework",
          "AWS",
          "Terraform",
          "Serverless framework",
          "Gradle",
          "Jira",
          "Maven",
          "J Meter",
          "Jenkins",
          "Docker",
          "Unit Tests",
          "AWS Cognito",
          "Microservices",
          "Git",
          "JWT"
        ],
        "screenshot": "/static/img/showcase/avvillas_tc.webp",
        "url": "https://www.avvillas.com.co/solicitar-tarjeta-credito/inicio"
      },
      {
        "start_date": "07/02/2022",
        "end_date": "06/07/2022",
        "enterprise": "Aval Digital Labs & Los Nogales school - MentuApp - Ceiba Software S.A.S",
        "isRecent": false,
        "project": "Mentu App",
        "role": "Full-Stack developer",
        "resume": [
          "Development of a learning platform for primary and secondary education, based on a hexagonal architecture, oriented towards microservices, and utilizing Serverless Framework with AWS Node.js (TypeScript) and AWS Lambdas. This approach promotes maintainability, high availability, and resilience to errors",
          "Using Serverless Framework, strategies were implemented with AWS CloudFormation to decentralize each Lambda function in alignment with the desired data lake, connecting various Amazon Web Services such as API Gateway, S3 (hooks), SNS, SQS, among others",
          "An ETL process was established to deliver standardized and optimized information for the Metabase platform, generating updated and complete data through AWS EventBridge",
          "An ETL was made available that delivers standardized and optimized information for the Metabase platform generating updated and complete information through AWS Eventbridge",
          "The frontend was built with React.js, Webpack, and TypeScript, segmenting the core business functionalities into different microservices via Module Federation, and generalizing graphical components of the frontend through a shared library exposed via Storybook, all based on best practices",
          "External applications such as Mixpanel, Concerto, Hotjar, and Google Analytics were integrated to ensure effective strategies for the target audience (teachers and students)"
        ],
        "additional_info": [
          "MySQL",
          "MongoDB",
          "PostgresSQL",
          "Nest JS",
          "AWS SQS",
          "Node.js",
          "HTML",
          "CSS",
          "React.js",
          "Microfrontend",
          "Storybook",
          "Design systems",
          "Tailwind",
          "AWS Cognito",
          "TypeScript",
          "Serverless framework"
        ],
        "screenshot": "/static/img/showcase/mentu.webp",
        "url": "https://mentu.co"
      },
      {
        "start_date": "12/12/2021",
        "end_date": "27/12/2021",
        "enterprise": "Ceiba Software S.A.S",
        "isRecent": false,
        "project": "ADN Ceiba",
        "role": "Software architect developer",
        "resume": [
          "A hexagonal architecture was defined and developed where domain orientation where solid principles and maintainability of the projects are favored. all this under a continuous integration process with static code analysis and execution of tests that guarantee the quality of the developed project.",
          "It was possible to build front implemented under a core which shared the feature architecture with management of this global using Redux."
        ],
        "additional_info": [
          "MySQL",
          "SASS",
          "HTML",
          "CSS",
          "React.js",
          "TypeScript",
          "Redux",
          "Nest JS",
          "J Meter",
          "NPM",
          "Jenkins",
          "SonarQube",
          "Git",
          "Unit Tests",
          "Integration Tests",
          "E2E Test"
        ]
      },
      {
        "start_date": "05/05/2021",
        "end_date": "10/12/2021",
        "enterprise": "SM Digital",
        "isRecent": false,
        "project": "SM Digital - Website development & Custom Integrations between third parties",
        "role": "Tech-lead developer",
        "resume": [
          "Custom Website development using WordPress as CMS modularization of business logic functionalities through good practices via Plugins",
          "Custom themes creation from scratch, guaranteeing fully responsive and optimized for the web, designed with the aim of optimizing profits and generate customer visibility through Marketing strategies.",
          "Implementation of virtual stores and integrations with third parties such as payment gateways like ERP's, CRM's  and specialized platforms for collecting leads used in Marketing in addition implementation of SSO (Single Sign-On) services with social networks such as Facebook/Twitter/Instagram among others.",
          "Implementation of customized automated messaging strategies for platforms via WhatsApp using authorized APIs for the business which made it possible to communicate reports to lists of authorized clients in a simple way.",
          "Various strategies were used for the frontend and backend highlighting HTML, CSS, JS (jQuery Framework, Angular JS and React JS)",
          "PHP and Node JS respectively for the creation of websites and generation of applications for third parties as well as integrators between unsupported platforms."
        ],
        "screenshot": "/static/img/showcase/smdigital.webp",
        "url": "https://smdigital.com.co",
        "additional_info": [
          "MySQL",
          "MongoDB",
          "jQuery",
          "Node.js",
          "Express",
          "React.js",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "Jira",
          "Trello",
          "WordPress",
          "WooCommerce",
          "JavaScript",
          "TypeScript",
          "PHP",
          "Auth0",
          "JWT",
          "Laravel"
        ]
      },
      {
        "start_date": "05/04/2020",
        "end_date": "29/11/2020",
        "enterprise": "Nutresa Group - SM Digital",
        "isRecent": false,
        "project": "E-learning Client School for vendors (LMS)",
        "role": "Full-Stack developer",
        "resume": [
          "Full-Stack project developed from scratch which had to be built under the WordPress CMS framework which exposed REST services to be consumed from the application client.",
          "The frontend had to be built with Angular JS and the use of libraries was allowed for the manipulation of multimedia content.",
          "Implemented UX strategies due to the target population (50 years or older)",
          "The delivery of multimedia resources had to be optimized and respond to a high flow of users using AWS S3, AWS CloudFront among others."
        ],
        "screenshot": "/static/img/showcase/escuela_clientes.webp",
        "url": "https://escueladeclientesnutresa.com",
        "additional_info": [
          "MySQL",
          "Angular JS",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "AWS",
          "Jira",
          "Trello",
          "Git",
          "JavaScript",
          "PHP",
          "MVC"
        ]
      },
      {
        "start_date": "14/12/2019",
        "end_date": "04/05/2021",
        "enterprise": "SURA Insurances - Colombia - SM Digital",
        "isRecent": false,
        "project": "SURA Advisors Intranet",
        "role": "Full-Stack developer",
        "resume": [
          "Full-Stack project where the integration of a SEUS 4 (Active Directory - SAML) was required integrating it with an E-Commerce using WordPress with WooCommerce as CMS.",
          "According to the good practices for WordPress it was required to set up an adaptable plugin based on an MVC architecture which favored the division of its logic and components.",
          "The application had to have custom reports generated via CSV which come from different sources such as Google Docs and external REST APIs.",
          "The project was completed by complying with the functional requirements and the quality of the software advocated by the client."
        ],
        "additional_info": [
          "SASS",
          "CSS",
          "jQuery",
          "Bootstrap",
          "WordPress",
          "WooCommerce",
          "NPM",
          "Jira",
          "Trello",
          "SAML",
          "PHP",
          "MySQL",
          "Git",
          "JavaScript"
        ]
      },
      {
        "start_date": "16/05/2019",
        "end_date": "23/06/2019",
        "enterprise": "Zenú meat foods - Colombia - SM Digital",
        "isRecent": false,
        "project": "Corporate Zenú - Game Advance and learn!",
        "role": "Frontend developer",
        "resume": [
          "Interactive Frontend project developed from scratch with Angular 7 technology under the architecture recommended by the Angular style guide. It sought to satisfy the principles of maintainability respecting concepts of clean code and design patterns suggested by the framework"
        ],
        "additional_info": [
          "Angular JS",
          "AWS",
          "Jira",
          "Trello",
          "PHP",
          "JavaScript",
          "TypeScript",
          "Functional Test"
        ]
      },
      {
        "start_date": "16/05/2019",
        "end_date": "23/06/2019",
        "enterprise": "Familia Group",
        "isRecent": false,
        "project": "Familia Group Co - Napkin simulator - SM Digital",
        "role": "Full-Stack developer",
        "resume": [
          "Full-Stack interactive project developed from scratch under the WordPress CMS Framework.",
          "Due to the infrastructure suggested by the client it was necessary to use jQuery and libraries focused on manipulating the DOM.",
          "The project required respecting very specific brand directives directly related to the functional requirements.",
          "The component should also include administrative features to manage the creation, editing, updating, and deletion of custom napkins, allowing for the provision of a user-friendly and intuitive user interface for its use.",
          "In addition to enabling napkin customization as its primary function, it also allowed the final result to be delivered by email, generating valuable leads for the client."
        ],
        "additional_info": [
          "MySQL",
          "Bootstrap",
          "SASS",
          "HTML",
          "Jira",
          "Trello",
          "WordPress",
          "PHP",
          "MVC",
          "jQuery"
        ],
        "screenshot": "/static/img/showcase/personalizador_familia.webp"
      },
      {
        "start_date": "14/12/2019",
        "end_date": "04/05/2021",
        "enterprise": "COLGAS",
        "isRecent": false,
        "project": "Insa (NORGAS) - Energy quote simulator - SM Digital",
        "role": "Frontend developer",
        "screenshot": "/static/img/showcase/simulador_energetico.webp",
        "url": "https://colgas.com/simulador-energetico-login/",
        "resume": [
          "Frontend project developed from scratch which required using entirely JavaScript (Vanilla) language.",
          "This quote used very precise calculations that are carried out in detail due to the company's quality policies therefore that the interaction with the client had to be constant",
          "The continuous deployment process was properly configured through scheduled tasks on a remote server in the cloud."
        ],
        "additional_info": ["MySQL", "Bootstrap", "SASS", "HTML", "Jira", "JavaScript"]
      },
      {
        "start_date": "03/02/2019",
        "end_date": "12/06/2021",
        "enterprise": "Presente Éxito group",
        "isRecent": false,
        "project": "Vacation resort quote simulator/generator",
        "role": "Full-Stack developer",
        "resume": [
          "Full-Stack project developed from scratch with PHP technologies and using the Framework for WordPress web pages.",
          "In accordance with the good practices of the Wordpress CMS it was required to build entirely using a plugin implementing a MVC architecture.",
          "It was important for the client to respond clearly to the functional requirements whose importance lay in the calculation the evaluation of results and their deployment (PDF - Email) which were used for strategies of Marketing and Digital Guidelines. It was essential that it be fully manageable and configurable."
        ],
        "additional_info": [
          "MySQL",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "WordPress",
          "Jira",
          "JavaScript",
          "MVC",
          "Trello",
          "PHP",
          "jQuery"
        ]
      },
      {
        "start_date": "07/11/2017",
        "end_date": "10/10/2018",
        "enterprise": "EAFIT University",
        "isRecent": false,
        "project": "EAFIT University - Plataforma Línea en Informática Educativa (Imaginar futuros)",
        "role": "Systems analyst",
        "resume": [
          "Full-Stack project developed from scratch under the WordPress CMS Framework (PHP).",
          "It required using good CMS practices for its construction so its modules were developed under the Kernel architecture /Plugin common in CMS such as WordPress.",
          "It required managing information dynamically from the frontend using jQuery and Ajax.",
          "Different cloud service structures had to be maintained for its users and collaborators using the AWS suite for this (S3, Glacier, Cloudfront, Route 53, etc.) and administration of Azure and Office 365 Cloud services."
        ],
        "screenshot": "/static/img/showcase/linea_ie.webp",
        "additional_info": [
          "MySQL",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "WordPress",
          "Jira",
          "JavaScript",
          "AWS",
          "MVC",
          "Trello",
          "PHP",
          "jQuery",
          "Office 365"
        ]
      }
    ]
  },
  "Services": {
    "metadata": {
      "title": "Services | José Duque",
      "description": "Backend, Frontend, Full-stack or consulting services at glance"
    },
    "title": "Services & <br></br>Technology stack",
    "content": [
      {
        "title": "Backend development",
        "icon": "Database",
        "subtitle": "General backend development services",
        "description": "Server-side logic programming, databases, API programming, third-party integrations, architecture definitions and continuous deployment based on good development practices."
      },
      {
        "title": "Frontend development",
        "icon": "Computer",
        "subtitle": "General frontend development services",
        "description": "Client-side logic programming, based on semantic structuring practices, adaptability, accessibility and maintainability."
      },
      {
        "title": "Website development",
        "icon": "CodeXml",
        "subtitle": "Complete website development services",
        "description": "Creation and maintenance of custom websites, informational sites, E-Commerces, Funnels, Courses and development of custom plugins for WordPress."
      },
      {
        "title": "Consulting & Mentoring",
        "icon": "BookOpen",
        "subtitle": "Customized development mentoring service",
        "description": "Mentoring and consulting services in general topics, like optimization, security and good development practices."
      }
    ],
    "badges": {
      "title": "Tools & Soft-skills",
      "content": [
        {
          "name": "AWS",
          "type": "hard"
        },
        {
          "name": "Azure",
          "type": "hard"
        },
        {
          "name": "CSS",
          "type": "hard"
        },
        {
          "name": "Tailwind",
          "type": "hard"
        },
        {
          "name": "HTML5",
          "type": "hard"
        },
        {
          "name": "DDD Architecture",
          "type": "soft"
        },
        {
          "name": "Laravel",
          "type": "hard"
        },
        {
          "name": "React.js",
          "type": "hard"
        },
        {
          "name": "Vue.js",
          "type": "hard"
        },
        {
          "name": "WordPress",
          "type": "hard"
        },
        {
          "name": "RabbitMQ",
          "type": "hard"
        },
        {
          "name": "Redis",
          "type": "hard"
        },
        {
          "name": "MySQL",
          "type": "hard"
        },
        {
          "name": "MongoDB",
          "type": "hard"
        },
        {
          "name": "PostgreSQL",
          "type": "hard"
        },
        {
          "name": "Distributed architectures",
          "type": "soft"
        },
        {
          "name": "Monolithic architectures",
          "type": "soft"
        },
        {
          "name": "Clean Code",
          "type": "soft"
        },
        {
          "name": "Terraform",
          "type": "hard"
        },
        {
          "name": "Serverless framework",
          "type": "hard"
        },
        {
          "name": "Storybook",
          "type": "hard"
        },
        {
          "name": "Design Systems",
          "type": "soft"
        },
        {
          "name": "i18n",
          "type": "soft"
        },
        {
          "name": "Responsive design",
          "type": "soft"
        },
        {
          "name": "Docker",
          "type": "hard"
        },
        {
          "name": "Bootstrap",
          "type": "hard"
        },
        {
          "name": "Kanban",
          "type": "soft"
        },
        {
          "name": "Jenkins",
          "type": "hard"
        },
        {
          "name": "Node JS",
          "type": "hard"
        },
        {
          "name": "SpringBoot",
          "type": "hard"
        },
        {
          "name": "SpringCloud",
          "type": "hard"
        },
        {
          "name": "Nest JS",
          "type": "hard"
        },
        {
          "name": "Agile development",
          "type": "soft"
        },
        {
          "name": "OOP",
          "type": "soft"
        },
        {
          "name": "Time-management",
          "type": "soft"
        },
        {
          "name": "Time flexibility",
          "type": "soft"
        },
        {
          "name": "JWT",
          "type": "hard"
        },
        {
          "name": "Github actions",
          "type": "hard"
        },
        {
          "name": "ORM's",
          "type": "soft"
        },
        {
          "name": "ODM's",
          "type": "soft"
        },
        {
          "name": "Monitoring",
          "type": "soft"
        },
        {
          "name": "Observability",
          "type": "soft"
        },
        {
          "name": "Jest",
          "type": "hard"
        },
        {
          "name": "Playwright",
          "type": "hard"
        },
        {
          "name": "Cypress",
          "type": "hard"
        },
        {
          "name": "SonarQube",
          "type": "hard"
        },
        {
          "name": "Unit tests",
          "type": "hard"
        },
        {
          "name": "Vitest",
          "type": "hard"
        },
        {
          "name": "Integration tests",
          "type": "hard"
        },
        {
          "name": "e2e tests",
          "type": "hard"
        },
        {
          "name": "SASS",
          "type": "hard"
        },
        {
          "name": "Datadog",
          "type": "hard"
        },
        {
          "name": "Microservices resiliency",
          "type": "soft"
        },
        {
          "name": "Redux",
          "type": "hard"
        },
        {
          "name": "Pinia",
          "type": "hard"
        },
        {
          "name": "VueX",
          "type": "hard"
        },
        {
          "name": "TanStack Query",
          "type": "hard"
        },
        {
          "name": "jQuery",
          "type": "hard"
        },
        {
          "name": "Wordpress Plugin Development",
          "type": "hard"
        },
        {
          "name": "CircleCI",
          "type": "hard"
        },
        {
          "name": "SEO",
          "type": "soft"
        },
        {
          "name": "Next JS",
          "type": "hard"
        },
        {
          "name": "Zustand",
          "type": "hard"
        },
        {
          "name": "Accessibility",
          "type": "soft"
        },
        {
          "name": "SSR",
          "type": "soft"
        },
        {
          "name": "Quasar",
          "type": "hard"
        },
        {
          "name": "Kubernetes",
          "type": "hard"
        },
        {
          "name": "Hexagonal architecture",
          "type": "soft"
        }
      ]
    },
    "languages": {
      "title": "Main development languages",
      "content": [
        {
          "color": "#0369a1",
          "tag": "Typescript",
          "value": 93
        },
        {
          "color": "#facc15",
          "tag": "Javascript",
          "value": 95
        },
        {
          "color": "#7e22ce",
          "tag": "PHP",
          "value": 75
        },
        {
          "color": "#c2410c",
          "tag": "Java",
          "value": 35
        }
      ]
    }
  },
  "GamesDevelopment": {
    "metadata": {
      "title": "Games development | José Duque",
      "description": "Part of the practice that greatly enriches my career"
    }
  },
  "MusicProduction": {
    "metadata": {
      "title": "Music Production | José Duque",
      "description": "A beloved hobby which balances everything"
    }
  },
  "Contact": {
    "metadata": {
      "title": "Contact | José Duque",
      "description": "Get in touch with me for any inquiries or support. I am here to help you"
    }
  },
  "Blog": {
    "metadata": {
      "title": "Blog | José Duque",
      "description": "Discover the latest news, tips and interesting tech & lifestyle articles"
    }
  },
  "Pdf": {
    "introduction": "I consider myself a person with a profile based on responsibility, I am an active, recursive, creative, and orderly developer. I have knowledge in TypeScript, Javascript, and PHP with UML, XML, SQL/NoSQL.\nI like so much web programming in general and I am pretty interested in developing a Full-Stack profile. I have a special taste for new technologies and give it all in each project.",
    "databases": "MongoDB, PostgreSQL, MySQL, Redis.",
    "cicd": "Jenkins, Github Actions, SonarQube, Docker, CircleCI",
    "backend": "Nest JS, Node JS, Express, Spring Boot, RabbitMQ, Azure Service Bus, Amazon SQS, Laravel, Next JS",
    "programming_languages": "JavaScript, TypeScript, PHP, Java.",
    "frontend": "HTML, CSS, React JS, , Vue JS, SASS, Tailwind, Redux, Pinia",
    "cloud": "Amazon Web Services, Azure Cloud, Terraform, Serverless framework",
    "security": "JWT, Auth0, Cognito.",
    "architecture": "Hexagonal Architecture, CQRS, MVC, Microservices, Event Driven Architecture.",
    "methodologies": "SCRUM, Kanban.",
    "experience": ":years years",
    "languages": [
      {
        "title": "Spanish",
        "subtitle": "Native - C2"
      },
      {
        "title": "English",
        "subtitle": "Proficient - B2"
      }
    ]
  }
}
