{
  "Sidebar": {
    "role": "Ingeniero Informático",
    "professional": {
      "title": "Carrera profesional",
      "links": [
        {
          "title": "Resumen",
          "url": "/"
        },
        {
          "title": "Servicios",
          "url": "/career/services"
        },
        {
          "title": "Proyectos",
          "url": "/career/projects"
        }
      ]
    },
    "other": {
      "title": "Más sobre mí",
      "links": [
        {
          "title": "Blog",
          "url": "/blog"
        }
      ]
    },
    "contact": {
      "title": "Información de contacto"
    },
    "complementary": {
      "sidebar": {
        "title": "Abrir/Cerrar menú"
      },
      "pdf": {
        "title": "Descargar HV",
        "dialog": {
          "title": "Descargar Hoja de vida",
          "description": "Descarga mi hoja de vida en formato PDF 🌟",
          "button": "Generar",
          "loading": "Generando..."
        }
      },
      "theme": {
        "title": "Cambiar colores del tema",
        "light": "Claro",
        "dark": "Oscuro",
        "system": "Sistema"
      },
      "activity": {
        "title": "Abrir actividad reciente",
        "dialog": {
          "title": "Últimas actualizaciones",
          "description": "Encontrarás actividad reciente o actualizaciones al instante sobre proyectos o noticias de interés",
          "button": "Visita mi perfil de Github",
          "empty": "No hay actividad reciente, inténtalo después."
        }
      }
    },
    "footer": {
      "mobile": {
        "title": "Opciones del tema"
      }
    }
  },
  "General": {
    "metadata": {
      "title": "Acerca de mí | José Duque",
      "description": "Desarrollador web Colombiano. Conoce mi portafolio, experiencia y servicios en programación para impulsar marcas.",
      "keywords": [
        "Desarrollador Web",
        "Backend",
        "Frontend",
        "Full-Stack",
        "Node JS",
        "React",
        "Vue",
        "Javascript",
        "Typescript"
      ]
    },
    "bubble": "¡Visita mi blog! ✏️",
    "role": "Ingeniero Informático",
    "resume": {
      "greetings": "¡Hola!, soy ",
      "excerpt1": "Ingeniero informático de Colombia con más de {years} años de experiencia en desarrollo de aplicaciones para la web.",
      "excerpt2": "Estoy enfocado en garantizar soluciones de calidad basadas en buenas prácticas con tecnologías sobre <b>arquitecturas monolíticas</b> así como <b>arquitecturas de microservicios</b>.",
      "description": {
        "title": "¿Qué he realizado?",
        "content": "Mi experiencia profesional ha proporcionado una <b>visión amplia de las necesidades específicas del cliente</b> necesaria para resolver diversos desafíos tecnológicos. He desempeñado roles como <b>consultor, líder técnico y coordinador técnico</b> para equipos de desarrollo tanto en el <b>sector público como privado</b>. Esto incluye trabajo para organizaciones como la <i>Alcaldía de Itagüí, Alcaldía de Bogotá, Ministerio de Educación Nacional y la Universidad EAFIT</i>.<br></br><br></br>También he impulsado <b>proyectos de desarrollo a la medida y creación de sitios web</b> para agencias de marketing a tiempo completo y como freelancer independiente. A través de colaboraciones con fábricas de software, he entregado soluciones para <b>startups educativas de alcance regional, la banca, seguros y el sector salud</b>, sectores que exigen un riguroso cumplimiento de políticas y alta calidad.<br></br><br></br>Para especializarme en tecnologías populares, completé sesiones intensivas de aprendizaje en lenguajes como <b>Node.js, PHP and Java</b> y realicé estudios individuales en tecnologías <b>Frontend</b> como <b>React, React Native and Vue.js</b>. En el lado del backend, mi enfoque en arquitecturas basadas en microservicios utilizando <b>Amazon Web Services (AWS) and Azure DevOps</b> me ha perfilado como un Desarrollador Full-Stack competente y listo para las demandas del mercado actual."
      }
    },
    "education": {
      "title": "Estudios académicos y certificaciones",
      "content": [
        {
          "start_date": "Noviembre 2021",
          "end_date": "",
          "enterprise": "",
          "isRecent": true,
          "project": "Certificación",
          "role": "Boot-camp Node JS - Corporación Ruta N - Ceiba Software S.A.S - Globant"
        },
        {
          "start_date": "2010",
          "end_date": "2016",
          "enterprise": "",
          "isRecent": true,
          "project": "Grados profesionales",
          "role": "Ingeniería Informática - Politécnico Colombiano Jaime Isaza Cadavid"
        },
        {
          "start_date": "2009",
          "end_date": "",
          "enterprise": "",
          "isRecent": true,
          "project": "Educación Primaria/Secundaria",
          "role": "Colegio Paula Montal"
        }
      ]
    },
    "services": {
      "title": "Servicios",
      "title2": "Stack de tecnologías",
      "subtitle": "Servicios generales",
      "download_button": "Descargar resumen",
      "experience": {
        "title": "Experiencia"
      },
      "languages": {
        "title": "Idiomas"
      },
      "tech_languages": {
        "title": "Lenguajes"
      },
      "framelibs": {
        "title": "Librerías & Frameworks"
      },
      "knowledges": {
        "title": "Herramientas & Habilidades blandas"
      },
      "certifications": {
        "title": "Certificaciones"
      }
    },
    "languages": {
      "title": "Lenguajes",
      "content": [
        {
          "title": "Español",
          "subtitle": "Nativo - C2"
        },
        {
          "title": "Inglés",
          "subtitle": "Básico profesional - B2"
        }
      ]
    },
    "404": {
      "title": "No encontrado",
      "subtitle": "No se ha encontrado el recurso solicitado",
      "button": "Llévame atrás"
    }
  },
  "Experience": {
    "metadata": {
      "title": "Proyectos | José Duque",
      "description": "Proyectos donde recientemente he contribuído"
    },
    "title": "Galería de proyectos",
    "subtitle": "Responsabilidades",
    "button": "Abrir en una nueva pestaña",
    "footer": "Aptitudes",
    "no-results": "No hay proyectos que concuerden con los filtros seleccionados, reintenta nuevamente",
    "showcase-end": "¡Hey! ¡el viaje comenzó aquí!",
    "filters": {
      "title": "Aptitudes",
      "placeholder": "Filtrar por {filter}",
      "input-placeholder": "Buscar filtros",
      "max-selection": "+5 filtros",
      "max-selection-mobile": "+1 filtros",
      "no-results": "No hay resultados",
      "reset": "Remover filtros"
    },
    "content": [
      {
        "start_date": "2023",
        "end_date": "Actualidad",
        "enterprise": "SURA Seguros - Ceiba Software S.A.S",
        "isRecent": true,
        "project": "SURA Seguros - Bus de integraciones",
        "role": "Desarrollador Backend",
        "resume": [
          "Optimicé los procesos de venta de seguros de vehículos/leasing/viajes diseñando soluciones serverless en Azure y APIs RESTful.",
          "Resolví desafíos críticos de integración entre Suratech (Salesforce) y los sistemas core de SURA Colombia implementando una arquitectura robusta orientada a eventos utilizando RabbitMQ y Azure Service Bus."
        ],
        "additional_info": [
          "Azure Functions",
          "Azure Service Bus",
          "CosmoDB",
          "Terraform",
          "Microservicios",
          "Node.js",
          "J-Meter",
          "Pruebas unitarias",
          "Pruebas de integración",
          "SonarQube",
          "Git",
          "JWT",
          "Scrum"
        ],
        "screenshot": "/static/img/showcase/sura_motos.webp",
        "url": "https://ecomm.sura.co/seguros/s/movilidad/motos/cotizador"
      },
      {
        "start_date": "11/07/2022",
        "end_date": "28/04/2023",
        "enterprise": "Aval Digital Labs - Grupo Aval AV Villas - Ceiba Software S.A.S",
        "isRecent": false,
        "project": "Aval Digital Labs - Banco AV Villas / Equipo de migración de infraestructura de Tarjeta de Crédito",
        "role": "Desarrollador Backend Senior",
        "resume": [
          "Modernicé la infraestructura legada de AWS migrando a Infraestructura como Código (Serverless Framework y Terraform), garantizando estándares empresariales estrictos y gobernanza arquitectónica para Aval Digital Labs y Banco AV Villas.",
          "Potencié el rendimiento de ejecución de AWS Lambdas y Step Functions mediante la refactorización y optimización de monolitos legados en Node.js, Java y Spring Boot.",
          "Superé el 85% de cumplimiento en Quality Gates de código y reforcé la seguridad de las aplicaciones implementando políticas y correcciones de vulnerabilidades conforme al estándar OWASP.",
          "Habilité una migración sin interrupciones en producción diseñando una estrategia de desarrollo en paralelo que permitió desplegar nuevos componentes de negocio junto con las cargas activas de migración."
        ],
        "additional_info": [
          "DynamoDB",
          "Node.js",
          "Spring Framework",
          "AWS",
          "Terraform",
          "Serverless Framework",
          "Gradle",
          "Jira",
          "Maven",
          "J-Meter",
          "Jenkins",
          "Docker",
          "Pruebas unitarias",
          "AWS Cognito",
          "Microservicios",
          "Git",
          "JWT"
        ],
        "screenshot": "/static/img/showcase/avvillas_tc.webp",
        "url": "https://www.avvillas.com.co/solicitar-tarjeta-credito/inicio"
      },
      {
        "start_date": "07/02/2022",
        "end_date": "06/07/2022",
        "enterprise": "Aval Digital Labs & Colegio los Nogales - MentuApp - Ceiba Software S.A.S",
        "isRecent": false,
        "project": "Mentu App",
        "role": "Desarrollador Full-Stack",
        "resume": [
          "Diseñé una plataforma de aprendizaje de alta disponibilidad para educación primaria y secundaria, implementando Arquitectura Hexagonal y AWS Serverless (Node.js/TypeScript) para garantizar resiliencia y mantenibilidad del sistema.",
          "Orquesté estrategias de infraestructura modular usando Serverless Framework y CloudFormation para desacoplar funciones Lambda, integrando sin fricciones API Gateway, S3, SNS y SQS con el data lake empresarial.",
          "Desarrollé un pipeline ETL automatizado activado por AWS EventBridge para entregar datos estandarizados en tiempo real a Metabase, habilitando reportes y analíticas precisas.",
          "Diseñé una arquitectura Micro-Frontend usando React.js y Webpack Module Federation para segmentar la lógica de negocio, estableciendo una librería de componentes UI compartida via Storybook para asegurar consistencia de diseño.",
          "Habilité estrategias de engagement de usuarios basadas en datos integrando herramientas avanzadas de analítica (Mixpanel, Concerto, Hotjar, Google Analytics) para rastrear el comportamiento de profesores y estudiantes."
        ],
        "additional_info": [
          "MySQL",
          "MongoDB",
          "PostgresSQL",
          "Nest JS",
          "AWS SQS",
          "Node.js",
          "HTML",
          "CSS",
          "React.js",
          "Microfrontend",
          "Storybook",
          "Sistemas de diseño",
          "Tailwind",
          "AWS Cognito",
          "TypeScript",
          "Serverless Framework"
        ],
        "screenshot": "/static/img/showcase/mentu.webp",
        "url": "https://mentu.co"
      },
      {
        "start_date": "12/12/2021",
        "end_date": "27/12/2021",
        "enterprise": "Ceiba Software S.A.S",
        "isRecent": false,
        "project": "Ceiba ADN",
        "role": "Arquitecto Desarrollador",
        "resume": [
          "Definí e implementé una Arquitectura Hexagonal fundamentada en Domain-Driven Design (DDD) y principios SOLID para maximizar la mantenibilidad.",
          "Garanticé la calidad y estabilidad del código estableciendo un pipeline de Integración Continua (CI) con pruebas automatizadas y análisis estático de código.",
          "Construí una arquitectura frontend escalable basada en un Core compartido y diseño orientado a features, implementando Redux para centralizar y optimizar la gestión del estado global."
        ],
        "additional_info": [
          "MySQL",
          "SASS",
          "HTML",
          "CSS",
          "React.js",
          "TypeScript",
          "Redux",
          "Nest JS",
          "J-Meter",
          "NPM",
          "Jenkins",
          "SonarQube",
          "Git",
          "Pruebas unitarias",
          "Pruebas de integración",
          "Pruebas E2E"
        ]
      },
      {
        "start_date": "05/04/2020",
        "end_date": "05/04/2021",
        "enterprise": "Grupo Nutresa - SM Digital",
        "isRecent": false,
        "project": "E-learning Escuela de clientes para vendedores (LMS)",
        "role": "Desarrollador Full-Stack",
        "resume": [
          "Diseñé una solución Headless WordPress desde cero, exponiendo APIs RESTful personalizadas para impulsar contenido dinámico en la aplicación cliente.",
          "Desarrollé un frontend multimedia enriquecido usando AngularJS, integrando librerías especializadas para gestionar, renderizar y manipular contenido multimedia complejo.",
          "Implementé estrategias de Experiencia de Usuario (UX) accesibles, específicamente adaptadas para una demografía senior (50+), garantizando facilidad de uso y altas tasas de adopción.",
          "Optimicé la entrega de contenido multimedia de alto tráfico implementando una estrategia CDN con AWS S3 y CloudFront, asegurando baja latencia y alta disponibilidad para usuarios globales."
        ],
        "screenshot": "/static/img/showcase/escuela_clientes.webp",
        "url": "https://escueladeclientesnutresa.com",
        "additional_info": [
          "MySQL",
          "Angular JS",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "AWS",
          "Jira",
          "Trello",
          "Git",
          "JavaScript",
          "PHP",
          "MVC"
        ]
      },
      {
        "start_date": "14/12/2019",
        "end_date": "04/05/2021",
        "enterprise": "SURA Seguros - Colombia - SM Digital",
        "isRecent": false,
        "project": "SURA Asesores Intranet",
        "role": "Desarrollador Full-Stack",
        "resume": [
          "Integré seguridad empresarial conectando SEUS 4 (Active Directory/SAML) con una plataforma WordPress/WooCommerce para habilitar autenticación segura.",
          "Diseñé un plugin WordPress personalizado usando el patrón MVC, asegurando una estricta separación de responsabilidades y mantenibilidad alineada con las mejores prácticas de la industria.",
          "Desarrollé un módulo de reportes personalizado que agrega datos de fuentes dispares (Google Docs, APIs REST externas) y genera reportes CSV unificados.",
          "Entregué una solución de alta calidad que cumplió estrictamente con todos los requerimientos funcionales y estándares de calidad de software exigidos por el cliente."
        ],
        "additional_info": [
          "SASS",
          "CSS",
          "jQuery",
          "Bootstrap",
          "WordPress",
          "WooCommerce",
          "NPM",
          "Jira",
          "Trello",
          "SAML",
          "PHP",
          "MySQL",
          "Git",
          "JavaScript"
        ]
      },
      {
        "start_date": "20/06/2019",
        "end_date": "31/07/2019",
        "enterprise": "Alimentos cárnicos Zenú",
        "isRecent": false,
        "project": "Zenú Corporativo - Juego ¡Avanza y aprende!",
        "role": "Desarrollador Frontend",
        "resume": [
          "Desarrollé un frontend escalable desde cero usando Angular 7, adhiriéndome estrictamente a la arquitectura oficial de la Guía de Estilos de Angular.",
          "Garanticé mantenibilidad a largo plazo aplicando principios de Código Limpio y patrones de diseño específicos del framework en todo el código."
        ],
        "additional_info": [
          "Angular JS",
          "AWS",
          "Jira",
          "Trello",
          "PHP",
          "JavaScript",
          "TypeScript",
          "Pruebas funcionales"
        ]
      },
      {
        "start_date": "16/05/2019",
        "end_date": "23/06/2019",
        "enterprise": "Grupo Familia",
        "isRecent": false,
        "project": "Grupo Familia Co - Simulador de servilletas - SM Digital",
        "role": "Desarrollador Full-Stack",
        "resume": [
          "Diseñé un Configurador de Productos Full-Stack personalizado (para servilletas personalizadas) dentro de WordPress, construido desde cero para cumplir con requerimientos interactivos específicos.",
          "Desarrollé un motor dinámico de manipulación del DOM usando jQuery, asegurando compatibilidad con las restricciones de infraestructura legada del cliente.",
          "Traduje directrices estrictas de identidad de marca en requerimientos funcionales y componentes UI pixel-perfect.",
          "Desarrollé un dashboard administrativo CRUD completo, permitiendo a personal no técnico gestionar, editar y actualizar plantillas de productos personalizados fácilmente a través de una interfaz intuitiva.",
          "Implementé un flujo de Generación de Leads que entregaba diseños personalizados por email, convirtiendo exitosamente el engagement de usuarios en leads de negocio tangibles."
        ],
        "additional_info": [
          "MySQL",
          "Bootstrap",
          "SASS",
          "HTML",
          "Jira",
          "Trello",
          "WordPress",
          "PHP",
          "MVC",
          "jQuery"
        ],
        "screenshot": "/static/img/showcase/personalizador_familia.webp"
      },
      {
        "start_date": "10/02/2019",
        "end_date": "13/03/2019",
        "enterprise": "COLGAS",
        "isRecent": false,
        "project": "Insa (NORGAS) - Simulador de cotización energética - SM Digital",
        "screenshot": "/static/img/showcase/simulador_energetico.webp",
        "url": "https://colgas.com/simulador-energetico-login/",
        "role": "Desarrollador Frontend",
        "resume": [
          "Desarrollé una aplicación frontend ligera y libre de dependencias desde cero usando JavaScript Vanilla, optimizando el rendimiento sin la sobrecarga de frameworks externos.",
          "Desarrollé un Motor de Cotización de alta precisión con lógica de cálculo compleja; colaboré estrechamente con el cliente para validar algoritmos contra políticas de calidad corporativas estrictas.",
          "Automaticé el proceso de Despliegue Continuo (CD) configurando tareas programadas (Cron jobs) en un servidor basado en la nube."
        ],
        "additional_info": ["MySQL", "Bootstrap", "SASS", "HTML", "Jira", "JavaScript"]
      },
      {
        "start_date": "03/02/2019",
        "end_date": "12/06/2021",
        "enterprise": "Grupo Presente Éxito",
        "isRecent": false,
        "project": "Simulador/Generador de cotizaciones de centros vacacionales",
        "role": "Desarrollador Full-Stack",
        "resume": [
          "Desarrollé una solución Full-Stack personalizada desde cero.",
          "Diseñé un plugin a medida usando el patrón MVC (Model-View-Controller), asegurando modularidad de código y adherencia a las mejores prácticas de desarrollo estrictas.",
          "Desarrollé un motor de cálculo y evaluación completamente configurable, capaz de procesar lógica compleja para generar reportes PDF dinámicos y notificaciones por email.",
          "Optimicé el sistema para Directrices de Marketing y Pauta Digital, proporcionando al cliente una interfaz administrativa flexible para gestionar resultados y estrategias de engagement de usuarios."
        ],
        "additional_info": [
          "MySQL",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "WordPress",
          "Jira",
          "JavaScript",
          "MVC",
          "Trello",
          "PHP",
          "jQuery"
        ]
      },
      {
        "start_date": "05/04/2020",
        "end_date": "05/04/2021",
        "enterprise": "SM Digital",
        "isRecent": false,
        "project": "SM Digital - Desarrollo de sitios web e integraciones personalizadas con terceros",
        "role": "Líder técnico",
        "resume": [
          "Diseñé arquitecturas WordPress personalizadas, modularizando lógica de negocio compleja en plugins a medida siguiendo las mejores prácticas de la industria.",
          "Desarrollé temas personalizados de alto rendimiento desde cero, garantizando diseño totalmente responsivo y optimización SEO para impulsar el tráfico y maximizar los ingresos del cliente.",
          "Implementé soluciones de comercio electrónico completas con integraciones profundas con pasarelas de pago, ERPs, CRMs y plataformas de generación de leads para marketing.",
          "Implementé autenticación Single Sign-On (SSO) segura para permitir acceso de usuarios mediante redes sociales (Facebook, Twitter, Instagram).",
          "Automaticé flujos de comunicación con clientes usando la API oficial de WhatsApp Business, optimizando la entrega de reportes y notificaciones.",
          "Aproveché un entorno Full Stack diverso (HTML, CSS, jQuery, Angular, React, PHP, Node.js) para construir aplicaciones web personalizadas e integradores middleware para plataformas no compatibles."
        ],
        "screenshot": "/static/img/showcase/smdigital.webp",
        "url": "https://smdigital.com.co",
        "additional_info": [
          "MySQL",
          "MongoDB",
          "jQuery",
          "Node.js",
          "Express",
          "React.js",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "Jira",
          "Trello",
          "WordPress",
          "WooCommerce",
          "JavaScript",
          "TypeScript",
          "PHP",
          "Auth0",
          "JWT",
          "Laravel"
        ]
      },
      {
        "start_date": "11/07/2017",
        "end_date": "10/10/2018",
        "enterprise": "Universidad EAFIT",
        "isRecent": false,
        "project": "Universidad EAFIT - Plataforma Línea en Informática Educativa (Imaginar futuros)",
        "role": "Analista de sistemas",
        "resume": [
          "Desarrollé una aplicación PHP a medida sobre el framework WordPress, adhiriéndome a las prácticas estándar de la industria para desarrollo de plugins.",
          "Construí interfaces de usuario interactivas aprovechando jQuery y AJAX para gestionar el flujo de datos en tiempo real entre el cliente y el servidor.",
          "Gestioné infraestructura cloud AWS (S3, Glacier, CloudFront, Route 53) para optimizar almacenamiento y entrega de contenido.",
          "Administré servicios cloud empresariales incluyendo Microsoft Azure y Office 365 para soportar gestión de usuarios y herramientas de colaboración."
        ],
        "screenshot": "/static/img/showcase/linea_ie.webp",
        "additional_info": [
          "MySQL",
          "Bootstrap",
          "SASS",
          "HTML",
          "CSS",
          "WordPress",
          "Jira",
          "JavaScript",
          "AWS",
          "MVC",
          "Trello",
          "PHP",
          "jQuery",
          "Office 365"
        ]
      }
    ]
  },
  "Services": {
    "metadata": {
      "title": "Servicios | José Duque",
      "description": "Backend, Frontend, Full-stack o consultoría a su servicio"
    },
    "title": "Servicios &<br></br>Stack tecnológico",
    "content": [
      {
        "icon": "Database",
        "title": "Desarrollo Backend",
        "subtitle": "Servicios generales de desarrollo backend",
        "description": "Implementación de lógica del lado del servidor, bases de datos, programación de APIs, integraciones con terceros, definiciones de arquitectura y despliegue contínuo basado en buenas prácticas de desarrollo."
      },
      {
        "icon": "Computer",
        "title": "Desarrollo Frontend",
        "subtitle": "Servicios generales de desarrollo frontend",
        "description": "Programación de lógica del lado del cliente, basado en prácticas de estructuración semántica, adaptabilidad, accesibilidad y mantenibilidad."
      },
      {
        "icon": "CodeXml",
        "title": "Programación de sitios web",
        "subtitle": "Servicios completos de desarrollo de sitios web",
        "description": "Creación y mantenimiento de Sitios Web a la medida, sitios informativos, E-Commerces, Funnels, Cursos y desarrollo de complementos personalizados para WordPress."
      },
      {
        "icon": "BookOpen",
        "title": "Mentoría & Asesoría",
        "subtitle": "Mentoría & Asesoría en desarrollo",
        "description": "Mentorías y asesorías en maquetación, optimización, seguridad y buenas prácticas de desarrollo desde sus diferentes frentes en general."
      }
    ],
    "badges": {
      "title": "Herramientas & Habilidades blandas",
      "content": [
        {
          "name": "AWS",
          "type": "hard"
        },
        {
          "name": "Azure",
          "type": "hard"
        },
        {
          "name": "CSS",
          "type": "hard"
        },
        {
          "name": "Tailwind",
          "type": "hard"
        },
        {
          "name": "HTML5",
          "type": "hard"
        },
        {
          "name": "Arquitectura DDD",
          "type": "soft"
        },
        {
          "name": "Laravel",
          "type": "hard"
        },
        {
          "name": "React.js",
          "type": "hard"
        },
        {
          "name": "Vue.js",
          "type": "hard"
        },
        {
          "name": "WordPress",
          "type": "hard"
        },
        {
          "name": "RabbitMQ",
          "type": "hard"
        },
        {
          "name": "Redis",
          "type": "hard"
        },
        {
          "name": "MySQL",
          "type": "hard"
        },
        {
          "name": "MongoDB",
          "type": "hard"
        },
        {
          "name": "PostgreSQL",
          "type": "hard"
        },
        {
          "name": "Arquitectura distribuída",
          "type": "soft"
        },
        {
          "name": "Arquitectura monolítica",
          "type": "soft"
        },
        {
          "name": "Código limpio",
          "type": "soft"
        },
        {
          "name": "Terraform",
          "type": "hard"
        },
        {
          "name": "Serverless framework",
          "type": "hard"
        },
        {
          "name": "Storybook",
          "type": "hard"
        },
        {
          "name": "Sistemas de diseño",
          "type": "soft"
        },
        {
          "name": "i18n",
          "type": "soft"
        },
        {
          "name": "Diseño responsivo",
          "type": "soft"
        },
        {
          "name": "Docker",
          "type": "hard"
        },
        {
          "name": "Bootstrap",
          "type": "hard"
        },
        {
          "name": "Kanban",
          "type": "soft"
        },
        {
          "name": "Jenkins",
          "type": "hard"
        },
        {
          "name": "Node JS",
          "type": "hard"
        },
        {
          "name": "SpringBoot",
          "type": "hard"
        },
        {
          "name": "SpringCloud",
          "type": "hard"
        },
        {
          "name": "Nest JS",
          "type": "hard"
        },
        {
          "name": "Desarrollo ágil",
          "type": "soft"
        },
        {
          "name": "OOP",
          "type": "soft"
        },
        {
          "name": "Administración de tiempo",
          "type": "soft"
        },
        {
          "name": "Flexibilidad de tiempo",
          "type": "soft"
        },
        {
          "name": "JWT",
          "type": "hard"
        },
        {
          "name": "Github actions",
          "type": "hard"
        },
        {
          "name": "ORM's",
          "type": "soft"
        },
        {
          "name": "ODM's",
          "type": "soft"
        },
        {
          "name": "Monitoreo",
          "type": "soft"
        },
        {
          "name": "Observabilidad",
          "type": "soft"
        },
        {
          "name": "Jest",
          "type": "hard"
        },
        {
          "name": "Playwright",
          "type": "hard"
        },
        {
          "name": "Cypress",
          "type": "hard"
        },
        {
          "name": "SonarQube",
          "type": "hard"
        },
        {
          "name": "Pruebas unitarias",
          "type": "hard"
        },
        {
          "name": "Vitest",
          "type": "hard"
        },
        {
          "name": "Pruebas de integración",
          "type": "hard"
        },
        {
          "name": "e2e tests",
          "type": "hard"
        },
        {
          "name": "SASS",
          "type": "hard"
        },
        {
          "name": "Datadog",
          "type": "hard"
        },
        {
          "name": "Resiliencia en microservicios",
          "type": "soft"
        },
        {
          "name": "Redux",
          "type": "hard"
        },
        {
          "name": "Pinia",
          "type": "hard"
        },
        {
          "name": "VueX",
          "type": "hard"
        },
        {
          "name": "TanStack Query",
          "type": "hard"
        },
        {
          "name": "jQuery",
          "type": "hard"
        },
        {
          "name": "Desarrollo de plugins para Wordpress",
          "type": "hard"
        },
        {
          "name": "CircleCI",
          "type": "hard"
        },
        {
          "name": "SEO",
          "type": "soft"
        },
        {
          "name": "Next JS",
          "type": "hard"
        },
        {
          "name": "React Native",
          "type": "hard"
        },
        {
          "name": "Zustand",
          "type": "hard"
        },
        {
          "name": "Accesibilidad",
          "type": "soft"
        },
        {
          "name": "SSR",
          "type": "soft"
        },
        {
          "name": "Quasar",
          "type": "hard"
        },
        {
          "name": "Kubernetes",
          "type": "hard"
        },
        {
          "name": "Arquitectura Hexagonal",
          "type": "soft"
        }
      ]
    },
    "languages": {
      "title": "Lenguajes de desarrollo principales",
      "content": [
        {
          "color": "#0369a1",
          "tag": "Typescript",
          "value": 93
        },
        {
          "color": "#facc15",
          "tag": "Javascript",
          "value": 95
        },
        {
          "color": "#7e22ce",
          "tag": "PHP",
          "value": 75
        },
        {
          "color": "#c2410c",
          "tag": "Java",
          "value": 35
        }
      ]
    }
  },
  "GamesDevelopment": {
    "metadata": {
      "title": "Desarrollo de juegos | José Duque",
      "description": "Parte de la práctica que enriquece enormemente mi carrera"
    }
  },
  "MusicProduction": {
    "metadata": {
      "title": "Producción musical | José Duque",
      "description": "Un querido pasatiempo que equilibra todo"
    }
  },
  "Contact": {
    "metadata": {
      "title": "Contacto | José Duque",
      "description": "Ponte en contacto conmigo para cualquier consulta o apoyo"
    }
  },
  "Blog": {
    "metadata": {
      "title": "Blog | José Duque",
      "description": "Descubre las últimas noticias, consejos y artículos interesantes sobre tecnología y estilo de vida",
      "not_found_description": "No se encontró el artículo solicitado."
    },
    "title": "Blog",
    "subtitle": "Últimos artículos",
    "content": "Explora mi colección de artículos sobre desarrollo web, arquitectura de software, perspectivas tecnológicas y otros temas que me apasionan.",
    "read_more": "Leer más",
    "reading_time": "{time} de lectura",
    "no_articles": "No se encontraron artículos, todavía.",
    "back_to_blog": "Volver al blog"
  },
  "Pdf": {
    "introduction": "Me considero una persona con un perfil basado en la responsabilidad, soy activo, recursivo, creativo y ordenado. Tengo conocimientos en TypeScript, Javascript y PHP con UML, XML, SQL/NoSQL.\nMe gusta la programación web y me interesa desarrollar un perfil Full-Stack. Tengo un gusto especial por aprender nuevas tecnologías y dar el 110% en cada proyecto.",
    "databases": "MongoDB, PostgreSQL, MySQL, Redis.",
    "cicd": "Jenkins, Github Actions, SonarQube, Docker, CircleCI.",
    "backend": "Nest JS, Node JS, Express, Spring Boot, RabbitMQ, Azure Service Bus, Amazon SQS, Laravel, Next JS",
    "programming_languages": "JavaScript, TypeScript, PHP, Java.",
    "frontend": "HTML, CSS, React JS, , Vue JS, SASS, Tailwind, Redux, Pinia",
    "cloud": "Amazon Web Services, Azure Cloud, Terraform, Serverless framework",
    "security": "JWT, Auth0, Cognito.",
    "architecture": "Arquitectura Hexagonal, CQRS, MVC, Microservicios, Arquitectura orientada a eventos.",
    "methodologies": "SCRUM, Kanban.",
    "experience": "{years} años",
    "languages": [
      {
        "title": "Español",
        "subtitle": "Nativo - C2"
      },
      {
        "title": "Inglés",
        "subtitle": "Sobresaliente - B2"
      }
    ]
  }
}
